DataProcessors/бит_ГрупповаяПечатьЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповаяПечатьЧеков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОсн</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатыКУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазбиватьПоЛицевымСчетам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздаватьСчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/бит_ГрупповаяПечатьЧеков/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедурыИФункции

// Процедура заполняет дерево документов введеных ранее. 
//
// Параметры: 
//
//	Оплата       - ДокументСсылка - Текущийд документ оплаты ку.
// 
//	ДеревоПКО    - ДеревоЗначение - Реквизит формы.
//
//	ЭлементФормы - ЭлементФормы   - ЭлементФормы дерева значений.
//
Процедура ЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Комментарий,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	ПриходныйКассовыйОрдер.СчетКасса,
	|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдер.бит_ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Комментарий,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента,
	|	ПоступлениеНаРасчетныйСчет.СчетБанк,
	|	ПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств,
	|	ПоступлениеНаРасчетныйСчет.бит_ЛицевойСчет
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартой.Ссылка,
	|	ОплатаПлатежнойКартой.Комментарий,
	|	ОплатаПлатежнойКартой.СуммаДокумента,
	|	ОплатаПлатежнойКартой.СчетКасса,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ОплатаПлатежнойКартой.бит_ЛицевойСчет
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Оплата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Запрос.Выполнить().Пустой() Тогда
	НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы);
		Возврат;	
	КонецЕсли;
	
	ПервыйУровень = ДеревоПКО.Строки.Найти(Оплата,"ПриходныйКассовыйОредер");
	
	Если ПервыйУровень = Неопределено Тогда
		
		ПервыйУровень = ДеревоПКО.Строки.Добавить();
		ПервыйУровень.ПриходныйКассовыйОредер = Оплата;	
		ПервыйУровень.Сумма                   = Оплата.СуммаДокумента;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ВторойУровень  = ПервыйУровень.Строки.Найти(Выборка.Ссылка,"ПриходныйКассовыйОредер");
		
		Если ВторойУровень = Неопределено Тогда
			
			ВторойУровень =	ПервыйУровень.Строки.Добавить();
			ВторойУровень.ПриходныйКассовыйОредер  = Выборка.Ссылка;
			ВторойУровень.Сумма                    = Выборка.СуммаДокумента;
			ВторойУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ВторойУровень.СчетУчета                = Выборка.СчетКасса;
			ВторойУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
		Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ВторойУровень.НомерКартинки = 1;
			
		ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ВторойУровень.НомерКартинки = 0;
		Иначе 
			ВторойУровень.НомерКартинки = 2;
		КонецЕсли;	
		// БИТ_ЖКХ 20.08.2014
		
	КонецЦикла; 
	
	Если ПервыйУровень.Строки.Количество() = 0 Тогда
		
		ДеревоПКО.Удалить(ПервыйУровень);	
		
	КонецЕсли;
	
	НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы);
	
КонецПроцедуры //ЗаполнитьДеревоПКО()

// Процедура заполняет дерево документов введеных ранее со счетами. 
//
// Параметры: 
//
//	Оплата       - ДокументСсылка - Текущийд документ оплаты ку.
// 
//	ДеревоПКО    - ДеревоЗначение - Реквизит формы.
//
//	ЭлементФормы - ЭлементФормы   - ЭлементФормы дерева значений.
//
Процедура НовыйЗаполнитьДеревоПКО(Оплата, ДеревоПКО, Элементформы)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.бит_ДокументОснование КАК бит_ДокументОснование,
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.бит_ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Оплата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивОснование = Новый Массив();
	Пока Выборка.Следующий() цикл
	МассивОснование.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.Комментарий КАК Комментарий,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	|	ПриходныйКассовыйОрдер.СчетКасса КАК СчетКасса,
	|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдер.бит_ЛицевойСчет КАК ЛицевойСчет,
	|	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование В(&МассивОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.Комментарий,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента,
	|	ПоступлениеНаРасчетныйСчет.СчетБанк,
	|	ПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств,
	|	ПоступлениеНаРасчетныйСчет.бит_ЛицевойСчет,
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование В(&МассивОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПлатежнойКартой.Ссылка,
	|	ОплатаПлатежнойКартой.Комментарий,
	|	ОплатаПлатежнойКартой.СуммаДокумента,
	|	ОплатаПлатежнойКартой.СчетКасса,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ОплатаПлатежнойКартой.бит_ЛицевойСчет,
	|	ОплатаПлатежнойКартой.ДокументОснование
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.ДокументОснование В(&МассивОснование)";
	
	Запрос.УстановитьПараметр("МассивОснование", МассивОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Запрос.Выполнить().Пустой() Тогда
		Элементформы.НачальноеОтображениеДерева  = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		Возврат;	
	КонецЕсли;
	
	ПервыйУровень = ДеревоПКО.Строки.Найти(Оплата,"ПриходныйКассовыйОредер");
	
	Если ПервыйУровень = Неопределено Тогда
		
		ПервыйУровень = ДеревоПКО.Строки.Добавить();
		ПервыйУровень.ПриходныйКассовыйОредер = Оплата;	
		ПервыйУровень.Сумма                   = Оплата.СуммаДокумента;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ВторойУровень  = ПервыйУровень.Строки.Найти(Выборка.ДокументОснование,"ПриходныйКассовыйОредер");
		
		Если ВторойУровень = Неопределено Тогда
			
			ВторойУровень =	ПервыйУровень.Строки.Добавить();
			ВторойУровень.ПриходныйКассовыйОредер  = Выборка.ДокументОснование;
			ВторойУровень.Сумма                    = Выборка.СуммаДокумента;
			ВторойУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ВторойУровень.СчетУчета                = Выборка.СчетКасса;
			ВторойУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
				
		ТретийУровень  = ВторойУровень.Строки.Найти(Выборка.Ссылка,"ПриходныйКассовыйОредер");
		
		Если ТретийУровень = Неопределено Тогда
			
			ТретийУровень =	ВторойУровень.Строки.Добавить();
			ТретийУровень.ПриходныйКассовыйОредер  = Выборка.Ссылка;
			ТретийУровень.Сумма                    = Выборка.СуммаДокумента;
			ТретийУровень.СтатьяДвиженийДенСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ТретийУровень.СчетУчета                = Выборка.СчетКасса;
			ТретийУровень.ЛицевойСчет              = Выборка.ЛицевойСчет;
			
		КонецЕсли;
		
		Если ВторойУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ВторойУровень.НомерКартинки = 1;
			
		ИначеЕсли ВторойУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ВторойУровень.НомерКартинки = 0;
		Иначе 
			ВторойУровень.НомерКартинки = 2;
		КонецЕсли;	
		// БИТ_ЖКХ 20.08.2014
		
		Если ТретийУровень.ПриходныйКассовыйОредер.ПометкаУдаления Тогда
			
			ТретийУровень.НомерКартинки = 1;
			
		ИначеЕсли ТретийУровень.ПриходныйКассовыйОредер.Проведен Тогда
			
			ТретийУровень.НомерКартинки = 0;
		Иначе 
			ТретийУровень.НомерКартинки = 2;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ПервыйУровень.Строки.Количество() = 0 Тогда
		
		ДеревоПКО.Удалить(ПервыйУровень);	
		
	КонецЕсли;
	
	Элементформы.НачальноеОтображениеДерева  = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры //ЗаполнитьДеревоПКО()

#КонецОбласти
